-- MySQL dump 10.13  Distrib 8.0.29, for Win64 (x86_64)
--
-- Host: localhost    Database: book_system
-- ------------------------------------------------------
-- Server version	8.0.29

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!50503 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `book`
--

DROP TABLE IF EXISTS `book`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!50503 SET character_set_client = utf8mb4 */;
CREATE TABLE `book` (
  `Id` int NOT NULL AUTO_INCREMENT COMMENT '主键Id',
  `BookName` varchar(20) NOT NULL COMMENT '书名',
  `Author` varchar(20) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '作者',
  `Type` int NOT NULL COMMENT '书籍类型',
  `Description` varchar(200) CHARACTER SET utf8mb4 COLLATE utf8mb4_0900_ai_ci NOT NULL COMMENT '简介描述',
  `CreateTime` datetime NOT NULL COMMENT '创建时间',
  `IsDeleted` tinyint(1) NOT NULL COMMENT '是否删除',
  PRIMARY KEY (`Id`)
) ENGINE=InnoDB AUTO_INCREMENT=27 DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_0900_ai_ci;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `book`
--

LOCK TABLES `book` WRITE;
/*!40000 ALTER TABLE `book` DISABLE KEYS */;
INSERT INTO `book` VALUES (1,'儒林外史','吴敬梓',3,'《中国古典文学名著丛书：儒林外史》是我国文学史上一部杰出的现实主义的长篇讽刺小说。','2023-01-13 20:14:06',0),(2,'天使也曾悲伤过','FAN小妖',1,'他是大明星，她是小记者。 他走他的复仇之路，她行她的探案之旅，他们的相遇注定牵扯出爱恨情仇。','2023-01-13 20:19:28',0),(3,'我这一辈子:老舍中短篇小说集','老舍',2,'老舍的小说主要描写平民尤其是城市贫民的生活和命运','2023-01-13 20:26:49',0),(4,'局外人','[法]阿尔贝·加缪',2,'《局外人》记述了一个小人物，被司法机关“妖魔化”，深刻地讽刺了现代法律的虚伪和愚弄的实质。','2023-01-13 20:28:37',0),(5,'杨德昌的电影世界','[法] 让-米歇尔·付东',4,'这是一本向已故的著名华语导演杨德昌和他的电影致敬的书。','2023-01-13 20:31:22',0),(6,'帝造者：勒布朗 詹姆斯','冯逸明',5,'詹姆斯三十五岁特别纪念，超三十五岁华丽实录，一部双重珍藏的“帝王级”史诗之作。','2023-01-13 20:35:43',0),(7,'随风不逝 张国荣','荣雪烟',5,'《随风不逝·张国荣》，一本专属荣迷的张国荣字典。致敬张国荣艺术，重温张国荣的行走旅程。','2023-01-13 20:36:48',0),(8,'人间草木','汪曾祺',3,'《人间草木》墨写出了草木山川、花鸟虫鱼的人味，写出了乡情民俗、凡人小事温润的乡土味。','2023-01-13 20:38:01',0),(9,'昆虫记','[法]亨利·法布尔',3,'《昆虫记》将昆虫写得有声有色，有情感有性格，自然亲切，妙趣横生，让读者如同进入了栩栩如生的昆虫世界。','2023-01-13 20:39:56',0),(10,'唱情歌','饶雪漫',1,'本书共由七个中短篇组成，讲述了七个女生关于爱与勇气的成长故事。','2023-01-13 20:41:33',0),(11,'你是我的荣耀','顾漫',1,'☆2019年，顾漫再度打造不可错过的甜爱经典。\n☆美貌流量咖大明星vs学神级航天工程师，高中她向他表白被拒，如今却在王者荣耀里重逢，是虐是甜？\n☆知名插画师eno为小说倾情创作唯美插图，人物形象淋漓展现。\n☆致敬致力于国家一线航天事业的工作人员。是为一群人的坚持，荣耀，和梦想。是为更多的星星。为更遥远的星河。','2023-01-13 20:42:43',0),(12,'月亮与六便士','[英]毛姆',2,'《月亮与六便士》是毛姆的长篇小说代表作。小说主人公斯特里克兰德原是位证券经纪人，在不惑之年突然响应内心的呼唤，舍弃一切去巴黎画画。种种遭遇之后，他来到南太平洋的塔希提岛。在那里，他的灵感如泉喷涌，直到得了麻风病依然作画不止。在他去世多年后人们才意识到，那个世人眼中不可理喻的疯子、贫困潦倒的流浪汉原来是个世所罕见的艺术天才。','2023-01-13 20:51:16',0),(13,'城南旧事','林海音',2,'《城南旧事》是台湾文学“祖母级人物”林海音的自传体小说集，以北京城南的童年生活为背景创作，每段故事既连贯性。小说以主人公英子的成长为主线，透过英子童稚的双眼，来看大人的喜怒哀乐、悲欢离合，有种说不出的天真，却道尽人世复杂的情感。角度看似狭小，却反映了当时北京广阔的历史面貌，带领人们重温了当年那笼罩着愁云惨雾的生活，有很强的社会意义。','2023-01-13 20:51:46',0),(14,'大话西方艺术史','意公子',4,'本书用浅白风趣的语言和逻辑清晰的脉络，梳理了30000多年西方艺术史的精髓，帮助你迅速构建完整的艺术史认知框架，提升你在生活中的独立审美意识。','2023-01-13 20:52:33',0),(15,'边走边画:城市风情速写课','[英] 马克·塔罗·霍姆斯',4,'本书向读者展示了如何从现实生活中汲取灵感, 又如何将其跃然于写生纸上。通过本书, 读者将会找到在城市和乡镇之中所有可以捕捉到的事物, 从静物、建筑, 到人们和繁华的街道。无论你是涂鸦爱好者, 还是经验丰富的艺术家, 本书都将通过写生作品带你走进外面的世界。','2023-01-13 20:53:09',0),(16,'标准数独技巧全书','张齐天，林苡田',5,'欢迎来到数独的世界！在这里，你会享受到逻辑推理的乐趣，锻炼缜密的思维。《标准数独技巧全书》讲述数独的四大基本技巧：排除、唯余法、区块和数对，还讲述八大定式候选数技巧：数组、普通鱼、鳍鱼、短链技巧、weiyi矩形、可规避矩形、全双值格致死解法和欠一数组。','2023-01-13 20:54:53',0),(17,'化妆与造型','毛晓青',5,'　本书从局部化妆修饰、生活造型、新娘造型、晚宴造型、影视化妆造型、创意化妆造型六个章节图文并茂进行介绍、对掌握整体造型设计、全面理解形象设计概念提供有效帮助。','2023-01-13 20:55:47',0),(18,'时间都知道','随侯珠',1,'随侯珠所著的《时间都知道（上下）》是一部长篇小说。\n如果时间重新给你一次机会，让你提早遇见爱人……\n时简和丈夫叶珈成原本是一对婚姻幸福、令人羡慕的恩爱夫妻，可两人还没有好好地相守到白头，时简却意外回到了二十一岁。','2023-01-13 20:56:48',0),(19,'无我不欢','藤萝为枝',1,'年少时爱过的个人，这辈子每一个清晨与傍晚，无灾无难，无她不欢。偏执腹黑律师合伙人——周渡温暖明艳的小太阳——覃樱那些沉冷的故事里，她是专享照进来的光。尽管她什么都不知道。她曾朝他迈出九十九步，剩下的这一步哪怕隔着万丈深渊，他也会朝她走过去。','2023-01-13 20:57:55',0),(20,'失恋阵线联萌','蓝淋',1,'本来是互有偏见的“敌人”，因为一对情侣的结合而都成了失恋的人。于是！甜软单纯的颜苗跟腹黑的套路高手谢子修，结成了相当不靠谱的高萌互撩组合——失恋阵线联萌！','2023-01-13 20:58:48',0),(21,'百年好合','蒋晓云',2,'蒋晓云“民国素人志”系列之一，讲述十四个民国女人的传奇一生。这些人中有上层官太，也有下层平民，有私奔台湾地区的清真面馆老板娘，有远嫁美国独自创业的上海滩舞女，也有享尽繁华的军官小姐。她们被卷入历史的洪流中，靠着一股韧劲儿，走着属于自己的人生棋局。','2023-01-13 20:59:34',0),(22,'人间词话','王国维',3,'南宋以来，论述诗词的著作如雨后春笋般涌出，至明清达到鼎盛，而《人间词话》能从中脱颖而出，成为二十世纪享有盛誉的文论经典，可见其成就非凡。陈寅恪说过：“先生之著述，或有时而不彰。先生之学说，或有时而可商。”的确，再有影响的书，也只是一家之言，或还有可商的余地，但此“独立之精神，自由之思想，历千万祀，与天壤而同久，共三光而永光”。','2023-01-13 21:00:17',0),(23,'阿Q正传','鲁迅',2,'《阿Q正传》是鲁迅小说的代表作，也是鲁迅一生中创作的一篇中型小说。它以辛亥革命前后的农村作为背景，塑造了阿Q这个不朽的流浪雇农的典型形象。','2023-01-13 21:01:06',0),(24,'骆驼祥子','老舍',3,'《骆驼祥子》是人民艺术家——老舍（舒庆春，1899-1966）所著的长篇小说，描述了20世纪20年代军阀混战时期人力车夫的悲惨命运。祥子是旧社会劳苦大众的代表人物。','2023-01-13 21:02:14',0),(25,'活着','余华',3,'《活着》讲述了人如何去承受巨大的苦难；讲述了眼泪的宽广和丰富；讲述了绝望的不存在；讲述了人是为了活着本身而活着的，而不是为了活着之外的任何事物而活着。','2023-01-13 21:03:06',0),(26,'test','test',1,'testteteastastast','2023-01-13 21:23:34',1);
/*!40000 ALTER TABLE `book` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2023-01-13 21:49:13
